##### ceate text file with some data and the file loading in to the jupitur notebook
##### create an csv file and display the csv format in jupitur notebook and add one additional column
#####

In [3]:
import pandas as pd
import numpy as np

In [43]:
file=open("textfile.txt",'w')
file.write('name,palce\njayanth,nandur\nnavya,guntur')
file.close()

In [44]:
a=pd.read_csv("textfile.txt")
a

      name   palce
0  jayanth  nandur
1    navya  guntur

In [33]:
file1=pd.read_csv("csv.txt")
file1

      name college          id
0  jayanth    khit  178x5a0133

In [34]:
file1["place"]=["CHEBROLU"]
file1

      name college          id     place
0  jayanth    khit  178x5a0133  CHEBROLU

In [47]:
file1=pd.read_csv("csv.txt",header=None)
file1

         0        1           2
0     name  college          id
1  jayanth     khit  178x5a0133

In [80]:
file1.to_json("csv.txt")
file=pd.read_json("csv.txt")
file

         0        1           2
0     name  college          id
1  jayanth     khit  178x5a0133

In [81]:
a=pd.read_json("json.txt")
a

        name college branch      year
0    jayanth    khit  civil  4th year
1      navya    khit    eee  4th year
2  sreekanth    khit   mech  4th year

In [82]:
import sys

In [87]:
f=file1.to_csv(sys.stdout)
f

,0,1,2
0,name,college,id
1,jayanth,khit,178x5a0133

In [89]:
f=file1.to_csv(sys.stdout,sep=" ")
f

 0 1 2
0 name college id
1 jayanth khit 178x5a0133

In [90]:
url="https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json"
df=pd.read_json(url,orient='columns')
df.head(10)

    integer            datetime  category
0         5 2015-01-01 00:00:00         0
1         5 2015-01-01 00:00:01         0
10        5 2015-01-01 00:00:10         0
11        5 2015-01-01 00:00:11         0
12        8 2015-01-01 00:00:12         0
13        9 2015-01-01 00:00:13         0
14        8 2015-01-01 00:00:14         0
15        8 2015-01-01 00:00:15         0
16        2 2015-01-01 00:00:16         0
17        1 2015-01-01 00:00:17         0